# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [1]:
# Step 0 - Import pandas for data loading and cleaning
import pandas as pd
import numpy as np

In [2]:
# Step 0.1 - Define URLs for the 3 datasets
# These are the raw CSV files provided by the bootcamp

url1 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"
url2 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv"
url3 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv"

In [3]:
# Step 0.2 - Load the datasets into DataFrames
# read_csv reads a CSV file into a pandas DataFrame

df1 = pd.read_csv(url1)
df2 = pd.read_csv(url2)
df3 = pd.read_csv(url3)

# Quick check
df1.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [4]:
# Step 1 - Standardize column names
# We make them lowercase and replace spaces with underscores for consistency

def clean_column_names(df):
    df.columns = (
        df.columns
        .str.strip()
        .str.lower()
        .str.replace(" ", "_")
    )
    return df

df1 = clean_column_names(df1)
df2 = clean_column_names(df2)
df3 = clean_column_names(df3)

In [5]:
# Step 2 - Clean invalid/inconsistent values
# This function applies fixes similar to the previous Data Cleaning lab

def clean_invalid_values(df):
    # Step 2.1 - Standardize gender values
    if "gender" in df.columns:
        df["gender"] = (
            df["gender"]
            .astype(str)
            .str.strip()
            .str.lower()
            .replace({
                "female": "F", "femal": "F", "f": "F",
                "male": "M", "m": "M"
            })
        )

    # Step 2.2 - Standardize state values (examples from lab instructions)
    if "state" in df.columns:
        df["state"] = df["state"].replace({
            "AZ": "Arizona",
            "Cali": "California",
            "WA": "Washington"
        })

    # Step 2.3 - Standardize education spelling
    if "education" in df.columns:
        df["education"] = df["education"].replace({
            "Bachelors": "Bachelor"
        })

    # Step 2.4 - Remove '%' from Customer Lifetime Value and convert to numeric
    if "customer_lifetime_value" in df.columns:
        df["customer_lifetime_value"] = (
            df["customer_lifetime_value"]
            .astype(str)
            .str.replace("%", "", regex=False)
        )
        df["customer_lifetime_value"] = pd.to_numeric(df["customer_lifetime_value"], errors="coerce")

    # Step 2.5 - Reduce vehicle class categories to simplify encoding
    if "vehicle_class" in df.columns:
        df["vehicle_class"] = df["vehicle_class"].replace({
            "Sports Car": "Luxury",
            "Luxury SUV": "Luxury",
            "Luxury Car": "Luxury"
        })

    return df

df1 = clean_invalid_values(df1)
df2 = clean_invalid_values(df2)
df3 = clean_invalid_values(df3)

In [6]:
# Step 3 - Fix data types and formatting issues

def format_data_types(df):
    # Step 3.1 - Convert number_of_open_complaints to numeric
    # Some values look like '1/5/00' -> we take the middle number (index 1)
    if "number_of_open_complaints" in df.columns:
        df["number_of_open_complaints"] = (
            df["number_of_open_complaints"]
            .astype(str)
            .str.split("/")
            .str[1]
        )
        df["number_of_open_complaints"] = pd.to_numeric(df["number_of_open_complaints"], errors="coerce")

    # Step 3.2 - Convert effective_to_date to datetime if present
    if "effective_to_date" in df.columns:
        df["effective_to_date"] = pd.to_datetime(df["effective_to_date"], errors="coerce")

    return df

df1 = format_data_types(df1)
df2 = format_data_types(df2)
df3 = format_data_types(df3)

In [7]:
# Step 4 - Handle missing values
# Numeric columns: fill with median
# Categorical columns: fill with mode

def handle_nulls(df):
    num_cols = df.select_dtypes(include=["int64", "float64"]).columns
    cat_cols = df.select_dtypes(include=["object"]).columns

    for col in num_cols:
        df[col] = df[col].fillna(df[col].median())

    for col in cat_cols:
        df[col] = df[col].fillna(df[col].mode()[0])

    return df

df1 = handle_nulls(df1)
df2 = handle_nulls(df2)
df3 = handle_nulls(df3)

In [8]:
# Step 5 - Combine datasets using concat
# concat stacks the dataframes vertically (rows)
# ignore_index=True resets index for clean combined dataset

df_combined = pd.concat([df1, df2, df3], ignore_index=True)

# Quick checks
df_combined.shape, df_combined.head()

((12074, 12),
   customer          st gender             education  customer_lifetime_value  \
 0  RB50392  Washington    nan                Master               588174.235
 1  QZ44356     Arizona      F              Bachelor               697953.590
 2  AI49188      Nevada      F              Bachelor              1288743.170
 3  WW63253  California      M              Bachelor               764586.180
 4  GA49547  Washington      M  High School or Below               536307.650

     income  monthly_premium_auto  number_of_open_complaints     policy_type  \
 0      0.0                1000.0                        0.0   Personal Auto
 1      0.0                  94.0                        0.0   Personal Auto
 2  48767.0                 108.0                        0.0   Personal Auto
 3      0.0                 106.0                        0.0  Corporate Auto
 4  36357.0                  68.0                        0.0   Personal Auto

    vehicle_class  total_claim_amount state
 0  Four-Door Car            2.704934   NaN
 1  Four-Door Car         1131.464935   NaN
 2   Two-Door Car          566.472247   NaN
 3            SUV          529.881344   NaN
 4  Four-Door Car           17.269323   NaN  )

In [9]:
# Step 6 - Check missing values and duplicates after combining

df_combined.isna().sum().sort_values(ascending=False).head(10)

st                           7070
number_of_open_complaints    7070
state                        5004
customer                        0
gender                          0
education                       0
customer_lifetime_value         0
income                          0
monthly_premium_auto            0
policy_type                     0
dtype: int64

In [10]:
# Step 6.1 - Check duplicates and remove them if any

df_combined.duplicated().sum()
df_combined = df_combined.drop_duplicates()

In [12]:
# Step 6.2 - Load the combine datasets into DataFrames

# Quick check
df_combined.head()

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,state
0,RB50392,Washington,nan,Master,588174.235,0.0,1000.0,0.0,Personal Auto,Four-Door Car,2.704934,NaN
1,QZ44356,Arizona,F,Bachelor,697953.590,0.0,94.0,0.0,Personal Auto,Four-Door Car,1131.464935,NaN
2,AI49188,Nevada,F,Bachelor,1288743.170,48767.0,108.0,0.0,Personal Auto,Two-Door Car,566.472247,NaN
3,WW63253,California,M,Bachelor,764586.180,0.0,106.0,0.0,Corporate Auto,SUV,529.881344,NaN
4,GA49547,Washington,M,High School or Below,536307.650,36357.0,68.0,0.0,Personal Auto,Four-Door Car,17.269323,NaN

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [13]:
# Step 7 - Load the cleaned marketing dataset
# This dataset is already cleaned according to the file name

url_marketing = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv"
marketing = pd.read_csv(url_marketing)

# Quick inspection
marketing.head()

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,2
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,...,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,A,1

In [14]:
# Step 8 - Pivot table: total revenue (sum of CLV) by sales channel
# pivot_table groups the data and aggregates the values

pivot_revenue = marketing.pivot_table(
    index="sales_channel",
    values="customer_lifetime_value",
    aggfunc="sum"
).round(2)

pivot_revenue

               customer_lifetime_value
sales_channel
Agent                      33057887.85
Branch                     24359201.21
Call Center                17364288.37
Web                        12697632.90

In [15]:
# Step 8.1 - Sort to see which channel is highest

pivot_revenue.sort_values(by="customer_lifetime_value", ascending=False)

               customer_lifetime_value
sales_channel
Agent                      33057887.85
Branch                     24359201.21
Call Center                17364288.37
Web                        12697632.90

In [16]:
# Step 9 - Pivot table: average CLV by gender and education
# index and columns create a matrix-style summary

pivot_clv_gender_edu = marketing.pivot_table(
    index="gender",
    columns="education",
    values="customer_lifetime_value",
    aggfunc="mean"
).round(2)

pivot_clv_gender_edu

education  Bachelor  College   Doctor  High School or Below   Master
gender
F           7874.27  7748.82  7328.51               8675.22  8157.05
M           7703.60  8052.46  7415.33               8149.69  8168.83

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [17]:
# Step 10 - Convert effective_to_date to datetime
# Extract month for grouping complaints by month

marketing["effective_to_date"] = pd.to_datetime(marketing["effective_to_date"], errors="coerce")
marketing["month"] = marketing["effective_to_date"].dt.month

In [18]:
# Step 11 - Group and count complaints by policy type and month
# Long format means each row is one (policy_type, month) observation

complaints_long = (
    marketing
    .groupby(["policy_type", "month"])["number_of_open_complaints"]
    .sum()
    .reset_index()
    .sort_values(["policy_type", "month"])
)

complaints_long

      policy_type  month  number_of_open_complaints
0  Corporate Auto      1                 443.434952
1  Corporate Auto      2                 385.208135
2   Personal Auto      1                1727.605722
3   Personal Auto      2                1453.684441
4    Special Auto      1                  87.074049
5    Special Auto      2                  95.226817